{
  "backend/main.mo": "Actor module defining healthcare roles, user profiles, bookings, brand info, and Stripe checkout/session logic with admin-restricted configuration.",
  "feature_evidence.json": "Feature evidence list mapping two branding-related color update features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file including pages, components, hooks, and configuration.",
  "frontend/index.css": "Tailwind base/theme CSS defining OKLCH-based color tokens and dark mode variables for global styling.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup registering all public, admin, phlebotomist, and doctor routes with QueryClient and ThemeProvider.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin layout enforcing admin/lab-executive access, showing a sidebar with admin navigation and redirecting unauthorized users. Displays loading and access verification states.",
  "frontend/src/components/doctor/DoctorLayout.tsx": "Doctor dashboard layout checking doctor-role access, showing role-specific navigation, and presenting an access-denied message when appropriate.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, navigation links, services, and contact details with Jeevan-themed styles.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, authentication, cart, and role-based dashboard redirects. Manages login/logout and mobile menu state.",
  "frontend/src/components/Layout.tsx": "Wraps the app with header, footer, and main content, and shows a profile setup modal for authenticated users without a profile.",
  "frontend/src/components/phlebotomist/PhlebotomistLayout.tsx": "Phlebotomist layout with role-gated access and sidebar navigation for dashboard and collections. Redirects unauthorized users to home.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter basic profile details and submit them to the backend. Handles form validation and profile creation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCart.ts": "Zustand-powered persistent cart store supporting item add/remove, quantity updates, and price/MRP/savings calculations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, logout, and status helpers. Includes logic to create and configure an AuthClient and restore stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks to fetch and mutate backend data through an actor, including services, profiles, roles, and admin checks. Handles query enabling based on actor availability.",
  "frontend/src/index.css": "Tailwind configuration file defining Jeevan brand color variables, light/dark themes, and utility classes. Applies styling defaults for typography and global elements.",
  "frontend/src/main.tsx": "Initializes the React app by mounting the root component and wrapping it with QueryClientProvider and InternetIdentityProvider. Loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections for mission, vision, values, and the company story using branded UI components. Includes styled content and iconography.",
  "frontend/src/pages/admin/AdminCRMPage.tsx": "Empty or placeholder admin CRM page.",
  "frontend/src/pages/admin/AdminCustomersPage.tsx": "Provides customer management with search, add, edit, and deactivate features using backend queries.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows key admin metrics such as orders, users, and pending reports retrieved from dashboard stats.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays and manages all customer bookings with order details, status, and basic filtering.",
  "frontend/src/pages/admin/AdminPatientsPage.tsx": "Manages patient records including creation, editing, deletion, and viewing related vitals.",
  "frontend/src/pages/admin/AdminReportsPage.tsx": "Displays mock lab reports with status badges and actions for viewing or verifying pending reports.",
  "frontend/src/pages/admin/AdminTestsPage.tsx": "Fetches and lists diagnostic services with active status, categories, and descriptions, handling loading and error states.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Loads and displays system users with role-based icons, status indicators, and basic profile details.",
  "frontend/src/pages/admin/AdminVitalsPage.tsx": "Manages patient vitals with filtering, status indicators, and dialogs for adding, updating, or deleting records.",
  "frontend/src/pages/BookingPage.tsx": "Implements a multi-step booking form with patient details, scheduling, and payment method selection, using react-hook-form and cart integration. Submits simulated bookings, clears the cart, and navigates to confirmation.",
  "frontend/src/pages/CartPage.tsx": "Displays cart contents with item details, pricing, and actions to remove items, clear the cart, or navigate to browsing tests when empty.",
  "frontend/src/pages/ContactPage.tsx": "Shows a contact section with phone, WhatsApp, email, and other communication details using styled cards.",
  "frontend/src/pages/doctor/DoctorAnalyticsPage.tsx": "Shows doctor performance metrics such as consultations, ratings, and patients, with loading and error handling.",
  "frontend/src/pages/doctor/DoctorAppointmentsPage.tsx": "Enables doctors to view and update appointment statuses across day, week, and month views with action handlers.",
  "frontend/src/pages/doctor/DoctorConsultationsPage.tsx": "Renders the teleconsultation interface with video controls and SOAP note tabs for entering consultation details.",
  "frontend/src/pages/doctor/DoctorDashboardPage.tsx": "Displays doctor dashboard stats including appointments, prescriptions, earnings, and rating with loading and error states.",
  "frontend/src/pages/doctor/DoctorEarningsPage.tsx": "Shows earnings summaries, pending payments, monthly stats, and detailed earnings data with export support.",
  "frontend/src/pages/doctor/DoctorHelpPage.tsx": "Provides help resources, quick links, and an FAQ accordion for doctor support and training.",
  "frontend/src/pages/doctor/DoctorPatientsPage.tsx": "Lists patient records with search filtering, loading states, and detailed patient info cards.",
  "frontend/src/pages/doctor/DoctorProfilePage.tsx": "Renders a doctor profile settings page with tabs for personal info, qualifications, availability, and settings using various UI components.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with quick services, promotional sections, and dynamically loaded health packages with navigation support.",
  "frontend/src/pages/OrdersPage.tsx": "Lists user orders with filtering tabs, status indicators, and navigation to view individual order details.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Tracks a specific order by showing a timeline of booking and processing steps with visual status indicators.",
  "frontend/src/pages/phlebotomist/PhlebotomistCollectionsPage.tsx": "Displays a list of assigned sample collections with status badges, patient details, and navigation actions, handling loading and error states.",
  "frontend/src/pages/phlebotomist/PhlebotomistDashboardPage.tsx": "Shows a metrics dashboard summarizing today's sample collection counts by status, with loading and error handling.",
  "frontend/src/pages/ReportsPage.tsx": "Displays available test reports with metadata and provides PDF download buttons for each report.",
  "frontend/src/pages/ServicePage.tsx": "Displays detailed information for a selected service using route params and predefined service data.",
  "frontend/src/pages/TestsPage.tsx": "Renders a searchable diagnostic tests catalog with cart integration and prescription upload workflows.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins with custom Jeevan brand tokens.",
  "project_state.json": "Project metadata describing features, theme‑update requirements, state versioning, and pending feature requests."
}